recept/src/Documents/Рецептуры/Рецептуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рецептуры</name>
  <basedOn>Document.Рецепт</basedOn>
  <registerRecords>InformationRegister.СтатусПродукции</registerRecords>
  <registerRecords>InformationRegister.СтатусОбеспеченияЗаказа</registerRecords>
  <registerRecords>AccumulationRegister.СоставРецептур</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьМатериалов</registerRecords>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуемоеКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСтоимостьПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗаКг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаНаТонну1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаНаТонну2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаНаТонну3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаНаТонну4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроизводства</name>
    <type>
      <types>EnumRef.СписокСтатусовПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Переработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГотовности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Покупатели</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗагрузки</name>
    <type>
      <types>EnumRef.СостояниеЗагрузкиСырьяПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыпуска</name>
    <type>
      <types>EnumRef.СостояниеВыпускаПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лабораторная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РецептураСостав</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаТонну</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяДляПроизводства</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТараДляПроизводства</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияЗагрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВПроизводстве</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.СостояниеОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Потребность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзРецептуры</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОбеспечения</name>
      <type>
        <types>EnumRef.СтатусыГотовностиПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>Выпущено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Счета</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/Documents/Рецептуры/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Рецептуры.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Рецептуры.Дата,
	|	Рецептуры.Наименование,
	|	Рецептуры.Номер,
	|	Рецептуры.Примечание,
	|	Рецептуры.ТребуемоеКоличество,
	|	Рецептуры.ЦенаЗаКг,
	|	Рецептуры.РецептураСостав.(
	|		НомерСтроки,
	|		Материал,
	|		КоличествоНаТонну,
	|		ТребуетсяДляПроизводства,
	|		Тара,
	|		ТараДляПроизводства,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Рецептуры КАК Рецептуры
	|ГДЕ
	|	Рецептуры.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьРецептураСоставШапка = Макет.ПолучитьОбласть("РецептураСоставШапка");
	ОбластьРецептураСостав = Макет.ПолучитьОбласть("РецептураСостав");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьРецептураСоставШапка);
		ВыборкаРецептураСостав = Выборка.РецептураСостав.Выбрать();
		Пока ВыборкаРецептураСостав.Следующий() Цикл   
			
	 //Выделаю красным строку - разделитель у которой сумма равна 0
	 // Исправить - 1)Поиск по наименованию
				Если 
					
					ВыборкаРецептураСостав.Сумма = 0 Тогда 
				
					ОбластьРецептураСостав.Область(1, 2, 1, 6).ЦветФона = WebЦвета.Коралловый;
					
				Иначе
					
					ОбластьРецептураСостав.Область(1, 2, 1, 6).ЦветФона = WebЦвета.Белый;
					
				КонецЕсли;
				
			ОбластьРецептураСостав.Параметры.Заполнить(ВыборкаРецептураСостав);
			ТабДок.Вывести(ОбластьРецептураСостав, ВыборкаРецептураСостав.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
